app/views/computers/reservation.html.slim


  p Show reservations for #{Reservation.first.date_prepare(@date).to_date}
---
SELECT  "reservations".* FROM "reservations" ORDER BY "reservations"."id" ASC LIMIT $1  [["LIMIT", 1]]

      = f.label :computer, 'Choose computer'
      = f.collection_select :computer_id, Computer.all, :id, :title
---
SELECT "computers".* FROM "computers"