app/views/computers/reservation.html.slim

SELECT  "computers".* FROM "computers" LIMIT $1  [["LIMIT", 11]]
---
.reservation_form
  = form_with model: @computer, url: reserve_computer_path(Computer.first), html: { id: "computer-reservation" } do |f|