app/controllers/computers_controller.rb

  def index
    @computers = Computer.all
---
SELECT "computers".* FROM "computers"

  def reservation
    if params["date_reservations(2i)"]
      @date = params["date_reservations(2i)"] + ' ' +  params["date_reservations(3i)"]
    else
      @date = Time.now.strftime("%-m %d")
    end
    @computers = Computer.all
---
SELECT "computers".* FROM "computers"

  def computer
    @computer ||= params[:id] ? Computer.find(params[:id]) : Computer.new
---
SELECT  "computers".* FROM "computers" WHERE "computers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def reserve
    @reservation = Reservation.new
    @reservation.computer_id = params[:computer_id]
    @reservation.user_id = current_user.id

    start_time = params[:start_time].to_datetime.change(month: params["date(2i)"].to_i, day: params["date(3i)"].to_i)

    @reservation.start_time = start_time

    @reservation.end_time_calculation(params[:duration].to_i)

    if @reservation.valid?
      @reservation.save!
---
INSERT INTO "reservations" ("computer_id", "user_id", "start_time", "end_time") VALUES ($1, $2, $3, $4) RETURNING "id"  [["computer_id", 2], ["user_id", 1], ["start_time", "2019-06-10 00:00:00"], ["end_time", "2019-06-10 01:00:00"]]