app/controllers/computers_controller.rb

  def computer
    @computer = Computer.find(params[:id])
---
SELECT  "computers".* FROM "computers" WHERE "computers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def reserve

    @reservation = Reservation.new
    @reservation.computer_id = params[:computer_id]
    @reservation.user =
      if params["user_id"]
        User.where(id: params["user_id"]).first
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]