app/controllers/software_requests_controller.rb

INSERT INTO "software_requests" ("computer_id", "user_id", "title", "url", "description") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["computer_id", 165], ["user_id", 159], ["title", "Software 1"], ["url", "www.google.com"], ["description", ""]]
---
  def create
    @software_request = SoftwareRequest.new(software_request_params)
    @software_request.user = current_user
    @software_request.computer = computer

    if @software_request.save!