app/models/reservation.rb

SELECT "reservations".* FROM "reservations" WHERE "reservations"."computer_id" = $1  [["computer_id", 2]]
---
  def validate_intersection
    #  Reservation.all.each do |reservation|
    if start_time.present? && end_time.present?
      Reservation.where(computer_id: computer.id).each do |reservation|